//
//  pinData.swift
//  TrainWindowGuide
//
//  Created by Kana Fujitani on 2023/06/02.
//

import Foundation

//配列・for文で複数のピンを立てる
//structの定義
struct PinData {
    var longitude:Double;
    var latitude:Double;
    var title:String;
    var subtitle:String;
}

let pinDatas: [[Any]] = [[36.3922466621714, 139.057872435089, "利根川", "流域面積が日本一の河川"],
                         [36.3911018795263, 139.060328833722, "群馬県庁", "33階建て。高さ153m。"],
                         [36.5629115, 139.1969948, "赤城山", "群馬県のほぼ中央に位置する上州の名山。晴天時によく見える。"],
                         [36.050584,  138.085549, "諏訪湖", "日本で23番目に広い湖。"],
                         [36.32883716, 138.9189998, "東邦亜鉛安中精錬所", "夜景が綺麗。"],
                         [36.33427411, 138.924529, "ベイシア安中店", "群馬発祥のスーパー"],
                         [36.2992921, 138.7486621, "妙義山", "上毛三山のひとつ。荒々しい岩肌が特徴。" ],
                         [35.97163084, 138.3701287, "八ヶ岳", "山。"],
                         [35.91030682, 138.2504178, "中央線旧立場川橋梁跡", "中央本線の橋が架橋した際に廃止された橋。"],
                         [34.982594, 136.658337, "四日市コンビナート", "日本で初めて形成された石油化学コンビナート"],
                         [35.36149952247431, 138.72736334024125, "富士山", "日本一の山"]]
